usr.bin/nfsstat/nfsstat.1
.\" Copyright (c) 1989, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)nfsstat.1	5.3 (Berkeley) 07/24/90
.\"
.Dd 
.Dt NFSSTAT 1
.Os BSD 4.4
.Sh NAME
.Nm nfsstat
.Nd report NFS statistics
.Sh SYNOPSIS
.Nm nfsstat
.Ob
.Ar interval
.Op Ar system Op Ar corefile
.Oe
.Sh DESCRIPTION
.Nm Nfsstat
delves into the system and normally reports certain statistics kept about
.Li NFS
client and server activity.
If
.Ar interval
is specified, then successive lines are summaries over the last
.Ar interval
seconds.
The command
.Dq Li nfsstat 5
will print what
.Li NFS
is doing every five seconds.
.Pp
A second argument is taken
to be the file containing the system's namelist.
Otherwise,
.Pa /vmunix
is used.
A third argument tells
.Nm nfsstat
where to look for
.Pa core  .
Otherwise,
.Pa /dev/kmem
is used.
.Sh FILES
.Dw /dev/kmem
.Di L
.Dp Pa /dev/kmem
.Dp Pa /vmunix
.Dp
.Sh SEE ALSO
.Xr netstat  1  ,
.Xr vmstat  1
.Sh HISTORY
.Nm Nfsstat
appears in 4.4 BSD.
