sbin/dmesg/dmesg.8
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)dmesg.8	6.4 (Berkeley) 03/16/91
.\"
.Dd 
.Dt DMESG 8
.Os BSD 4
.Sh NAME
.Nm dmesg
.Nd "collect system diagnostic messages to form error log"
.Sh SYNOPSIS
.Nm dmesg
.Op Fl 
.Sh DESCRIPTION
.Sy N.B.:
.Nm Dmesg
is obsoleted by
.Xr syslogd 8
for maintenance of the system error log.
.Pp
.Nm Dmesg
looks in a system buffer for recently printed diagnostic messages
and prints them on the standard output.
The messages are those printed or logged
by the system when errors occur.
.Pp
Available option:
.Bl -tag -width Ds
.It Fl
.Nm Dmesg
computes (incrementally) the new messages since the last time it
was run and places these on the standard output.
.El
.Sh FILES
.Bl -tag -width /var/log/msgbuf -compact
.It Pa /var/log/msgbuf
scratch file for memory of
.Ql Fl
option
.El
.Sh SEE ALSO
.Xr syslogd 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
