usr.bin/at/atrm/atrm.1
.\" Copyright (c) 1985, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)atrm.1	6.4 (Berkeley) 07/24/90
.\"
.Dd 
.Dt ATRM 1
.Os BSD 4.3
.Sh NAME
.Nm atrm
.Nd remove jobs spooled by
.Xr at 1
.Sh SYNOPSIS
.Nm atrm
.Op Fl f
.Op Fl i
.Op Fl
.Cx [
.Op Ar job #
.Op Ar name
.Cx ...
.Cx ]
.Cx
.Sh DESCRIPTION
.Nm Atrm
removes jobs that were created with the
.Xr at 1
command.
.Pp
Options available are:
.Pp
.Tp Fl f
all information regarding the
removal of the specified jobs is suppressed.
.Tp Fl i
.Nm atrm
asks if a job should be removed; a response of 'y' causes the job to be removed.
.Tp Fl
all jobs belonging to the person invoking
.Nm atrm
are removed.
.Tp
.Pp
If a
.Ar job
number(s) is specified,
.Nm atrm
attempts to remove only that
.Ar job
number(s).
.Pp
If a user(s) name is specified, all
jobs belonging to that user(s) are removed.
This form of invoking
.Nm atrm
is useful only to the super-user.
.Sh FILES
.Dw /usr/spool/at
.Di L
.Dp Pa /usr/spool/at
spool area
.Dp
.Sh SEE ALSO
.Xr at 1 ,
.Xr atq 1 ,
.Xr cron 8
.Sh HISTORY
.Nm Atrm
appeared in the 4.3 BSD release.
